_org_posts/_posts/2021-12-27-boj-9184.org
#+HTML: ---
#+HTML: title: BOJ 9184 신나는 함수 실행
#+HTML: tags: DP
#+HTML: ---
#+OPTIONS: ^:nil

** BOJ 9184 신나는 함수 실행
- 재귀함수 의사코드를 주고, 그대로 구현하는 문제
- 메모이제이션을 해줘야 함
** 접근하기
#+BEGIN_EXAMPLE
long long dp[21][21][21]로 메모이제이션
#+END_EXAMPLE

** 코드
#+BEGIN_SRC cpp
#include <cstdio>

int a, b, c;
typedef long long ll;
ll dp[21][21][21];

long long f(int a, int b, int c)
{
    if (a <=0 || b<=0 || c<= 0) return 1;
    if (a > 20 || b>20 || c>20) return f(20, 20, 20);

    if (dp[a][b][c] !=0) return dp[a][b][c];

    if (a <b && b < c)
        return dp[a][b][c] = f(a, b, c-1) + f(a, b-1, c-1) - f(a, b-1, c);

    return dp[a][b][c] = f(a-1, b, c) + f(a-1, b-1, c) + f(a-1, b, c-1) - f(a-1, b-1, c-1);
}

int main(int argc, char* argv[])
{
    while(1) {
        scanf("%d %d %d", &a, &b, &c);
        if (a == -1 && b == -1 && c == -1) {
            break;
        }
        printf("w(%d, %d, %d) = %lld\n", a, b, c, f(a, b, c));
    }
    return 0;
}
#+END_SRC

** 문제 링크
- https://www.acmicpc.net/problem/9184
